docs/posts/2025-07-10-christian-witness-time-war.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Jul 10, 2025 07:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Christian Witness in Time of War</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<h1 class="title">Christian Witness in Time of War
<br />
<span class="subtitle">Jul 10, 2025 06:57</span>
</h1>
<blockquote>
<p>
Christianity demands more than private values or partisan identity. It requires a public witness. And in a time of war, that witness includes a refusal to allow the state to define righteousness on its terms. When we do that, we are not practicing discipleship—we are participating in civil religion. A Christianity that affirms the state’s wars is not Christianity. It is idolatry.
</p>
</blockquote>

<p class="source">
<a href="https://www.christiancentury.org/features/church-cannot-bless-war" class="source">Stanley Hauerwas and C. Andrew Doyle</a>
</p>

<div class="tagline" id="org17dc047">
<p>
Tagged:  <a href="../tags/religion.html">Religion</a> <a href="../tags/quotes.html">Quotes</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jul 10, 2025 07:00.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
